
* Generalized Accessors
#+NAME: point-example
#+BEGIN_SRC lisp
  (defstruct point x y)

  (let ((p (make-point :x 12 :y 10)))
    (setf (point-x p) 33)
    (point-x p))
#+END_SRC
#+RESULTS: point-exampl: 33
#+NAME: hash-table-example
#+BEGIN_SRC lisp
  (let ((h (make-hash-table)))
    (setf (gethash :dog h) "fido")
    h)
#+END_SRC#+RESULTS: hash-table-example
: #<HASH-TABLE :TEST EQL :COUNT 1 {1003AE5C23}>
#+NAME: list-example
#+BEGIN_SRC lisp :results none
  (let ((foo (list 1 2 3)))
    (setf (nth 1 foo) "fido")
    foo)
#+END_SRC
#+RESULTS: (1 "fido" 3)

  You can define your own with the DEFSETF macro!

